--------------------------------------------
--! Configuration
--------------------------------------------
return {
   course_data_filename = "./in/coords.xml",
   splits_filename      = "./in/splits.htm",
   map_filename         = "./in/map.jpg",
   broken_cps           = "./in/broken.csv",
   map_dpi              = 72,
   map_scale_factor     = 30000,
   rotateAngle          = 0, ---< in degrees
   out_dir              = "./out",
   title                = nil, -- if nil from splits html

   start_x              = 490,
   start_y              = 831,

   ignore_list          = {},

   groups = {
      ["8 часов бегом"]         = {start = "12:15:00", "М8БО","Ж8БО","ММ8БК","МЖ8БК","ЖЖ8БК",},
      ["6 часов бегом"]         = {start = "12:15:00", "М6БО","Ж6БО","ММ6БК","МЖ6БК","ЖЖ6БК","6БО_МО","6БО_ЖО","6БК_МО","6БК_ЖО", "6БК_СО",},
      ["4 часа бегом"]          = {start = "12:15:00", "М4БО","Ж4БО","4БО_М","4БО_Ж","4БК_М","4БК_Ж","4БК_С"},
      ["3 часа бегом"]          = {start = "12:15:00", "М3БО","Ж3БО","3БО_МО","3БО_МЮ","3БО_ЖЮ","3БО_МВ","3БО_ЖВ","3БО_МСВ","3БО_ЖСВ","3БО_МУВ","3БО_ЖУВ"},
      ["2 часа бегом"]          = {start = "12:15:00", "2БО","2БО_М","2БО_Ж",},
      ["1 час бегом"]           = {start = "12:15:00", "1БО",},

      ["6 часов на велосипеде"] = {start = "12:30:00", "М6ВО","Ж6ВО","ММ6ВК","МЖ6ВК","ЖЖ6ВК","6ВО-МО","6ВО-ЖО","6ВК-МО","6ВК-ЖО","6ВК-СО","6ВК_МО","6ВК_СО","6ВК_ЖО","6ВО_МО","6ВО_ЖО",},
      ["3 часа на велосипеде"]  = {start = "12:30:00", "М3ВО","Ж3ВО","3ВО_М","3ВК_М","3ВК_Ж", "3В-МО",},
      ["2 часа на велосипеде"]  = {start = "12:30:00", "2ВО",},
      ["1 час на велосипеде"]   = {start = "12:30:00", "1ВО",},
   },

   javascript_map_scale = 1,

   display_team_name    = true,

   sfr_split_field_name_by_index = {
      "number",
      "id",
      "second_name",
      "first_name",
      "year_of_birth",
      "name",
      "result",
      "time",
      "_",
   },
}

